# 테트로미노 (골4)

import sys
input = sys.stdin.readline

N, M = map(int, input().split())
arr = [list(map(int, input().split())) for _ in range(N)]

direct=[#하늘
        [(0,0),(0,1),(0,2),(0,3)],
        [(0,0),(1,0),(2,0),(3,0)],
        # 노랑
        [(0,0),(1,0),(0,1),(1,1)],
        # 주황
        [(0,0),(1,0),(2,0),(2,1)],
        [(0,0),(1,0),(2,0),(2,-1)],
        [(0,0),(0,1),(0,2),(1,0)],
        [(0,0),(0,1),(0,2),(1,2)],
        [(0,0),(0,1),(1,1),(2,1)],
        [(0,0),(0,1),(1,0),(2,0)],
        [(0,0),(0,1),(0,2),(-1,2)],
        [(0,0),(0,1),(0,2),(-1,0)],
        # 연두
        [(0,0),(1,0),(1,1),(2,1)],
        [(0,0),(1,0),(0,1),(-1,1)],
        [(0,0),(0,1),(1,1),(1,2)],
        [(0,0),(0,1),(-1,1),(-1,2)],
        # 분홍
        [(0,0),(0,1),(1,1),(0,2)],
        [(0,0),(0,1),(-1,1),(1,1)],
        [(0,0),(0,1),(-1,1),(0,2)],
        [(0,0),(0,1),(-1,0),(1,0)]]

def find(x, y):
  result = 0
  for d in direct:
    cnt = [0, 0]
    for i in range(4):
      nx = x+d[i][0]
      ny = y+d[i][1]
      if 0 <= nx < N and 0 <= ny < M:
        cnt[0] += 1
        cnt[1] += arr[nx][ny]
      else:
        break
    if cnt[0] == 4:
      result = max(result, cnt[1])
  return result

answer = 0
for i in range(N):
  for j in range(M):
    answer = max(answer, find(i, j))
print(answer)
